### Pandas
open sourse hai 
easy to use data structure and data analysis tools

In [1]:
import numpy as np
import pandas as pd

Dataframe -> These are the combination of columns and rows and it will show you the representation format where how your data exactly looks like in the extension in the same way it will be loaded.

In [2]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Coumn4"])

In [3]:
df

      Column1  Column2  Column3  Coumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [6]:
df.to_csv('Test1.csv')

In [9]:
# Acessing the elements 
# .loc -> normal index in this we just focus on row index 
# .iloc -> in this we focus on row index as well as the column index 


df.loc['Row1']

Column1    0
Column2    1
Column3    2
Coumn4     3
Name: Row1, dtype: int32

In [10]:
type(df.loc['Row1'])

pandas.core.series.Series

In [11]:
df.iloc[:,:]

      Column1  Column2  Column3  Coumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [12]:
df.iloc[:,1:]

      Column2  Column3  Coumn4
Row1        1        2       3
Row2        5        6       7
Row3        9       10      11
Row4       13       14      15
Row5       17       18      19

In [13]:
df.iloc[0:3, 0:2]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9

In [14]:
type(df.iloc[0:3, 0:2])

pandas.core.frame.DataFrame